Tekla Open API Reference for Tekla Structures 2025
ProfileItem.aProfileItemParameters Property
 An array list with the profile item parameters.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList aProfileItemParameters { get; }
Public ReadOnly Property aProfileItemParameters As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace